app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at", "completed_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "faire des bisous"], ["todo_list_id", 1], ["created_at", "2022-03-30 13:30:18.084504"], ["updated_at", "2022-03-30 13:30:18.084504"], ["completed_at", nil]]
---
  def create
    @todo_item = @todo_list.todo_items.create(todo_item_params)

UPDATE "todo_items" SET "updated_at" = $1, "completed_at" = $2 WHERE "todo_items"."id" = $3  [["updated_at", "2022-03-30 13:30:21.252226"], ["completed_at", "2022-03-30 13:30:21.251773"], ["id", 2]]
---
  def complete
    @todo_item.update_attribute(:completed_at, Time.now)