app/controllers/todo_lists_controller.rb

INSERT INTO "todo_lists" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Manger"], ["description", ""], ["created_at", "2022-03-30 12:56:35.117002"], ["updated_at", "2022-03-30 12:56:35.117002"]]
---
  def create
    @todo_list = TodoList.new(todo_list_params)

    respond_to do |format|
      if @todo_list.save

UPDATE "todo_lists" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "todo_lists"."id" = $4  [["title", "Créer une webapp"], ["description", "Créer une todo list app pour le web en utilisant Ruby on Rails et en apprenant Github"], ["updated_at", "2022-03-31 13:16:31.272307"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @todo_list.update(todo_list_params)

SELECT "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "todo_lists" WHERE "todo_lists"."id" = $1  [["id", 2]]
---
  def destroy
    @todo_list = TodoList.find(params[:id])
    @todo_list.destroy