app/controllers/users_controller.rb

  def create
    @user = User.create(params.require(:user).permit(:username,
      :password))
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "Aurélafifolle"], ["password_digest", "[FILTERED]"], ["created_at", "2022-04-01 13:09:49.863196"], ["updated_at", "2022-04-01 13:09:49.863196"]]